<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of RingCentral Phone.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.RingCentralPhone</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RingCentral Phone</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>http://downloads.ringcentral.com/sp/RingCentralForMac</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%/RingCentral for Mac.app</string>
		<key>requirement</key>
		<string>identifier "com.ringcentral.ringcentralformac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M932RC5J66</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
