<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
 <key>Description</key>
 <string>Downloads the current release version of Private Internet Access and imports into Munki.</string>
 <key>Identifier</key>
 <string>com.github.dare-tech.munki.privateinternetaccess</string>
 <key>Input</key>
 <dict>
   <key>MUNKI_REPO_SUBDIR</key>
   <string>apps/%NAME%</string>
   <key>NAME</key>
   <string>Private Internet Access</string>
   <key>pkginfo</key>
   <dict>
     <key>blocking_applications</key>
     <array>
       <string>Private Internet Access.app</string>
     </array>
     <key>catalogs</key>
     <array>
       <string>testing</string>
     </array>
     <key>category</key>
			<string>Applications</string>
     <key>description</key>
     <string>Private Internet Access is the only proven no-log VPN service that encrypts your connection and provides an anonymous IP to protect your privacy.</string>
     <key>developer</key>
     <string>London Trust Media, Inc.</string>
     <key>display_name</key>
     <string>Private Internet Access</string>
     <key>minimum_os_version</key>
     <string>10.10</string>
     <key>name</key>
     <string>%NAME%</string>
     <key>unattended_install</key>
     <true/>
   </dict>
 </dict>
 <key>MinimumVersion</key>
 <string>1.0</string>
 <key>ParentRecipe</key>
 <string>com.github.dare-tech.download.privateinternetaccess</string>
 <key>Process</key>
 <array>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>additional_pkginfo</key>
       <dict>
         <key>installs</key>
         <array>
           <dict>
             <key>CFBundleVersion</key>
             <string>%version%</string>
             <key>path</key>
             <string>/Applications/Private Internet Access.app</string>
             <key>type</key>
             <string>application</string>
             <key>version_comparison_key</key>
             <string>CFBundleVersion</string>
           </dict>
         </array>
         <key>version</key>
         <string>%version%</string>
       </dict>
     </dict>
     <key>Processor</key>
     <string>MunkiPkginfoMerger</string>
   </dict>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>dmg_path</key>
       <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
       <key>dmg_root</key>
       <string>%RECIPE_CACHE_DIR%/%NAME%</string>
     </dict>
     <key>Processor</key>
     <string>DmgCreator</string>
   </dict>
   <dict>
     <key>Arguments</key>
     <dict>
       <key>pkg_path</key>
       <string>%dmg_path%</string>
       <key>repo_subdirectory</key>
       <string>%MUNKI_REPO_SUBDIR%</string>
     </dict>
     <key>Processor</key>
     <string>MunkiImporter</string>
   </dict>
 </array>
</dict>
</plist>
