<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the .zip file containing Nucleo.app.</string>
  <key>Identifier</key>
  <string>com.github.dare-tech.nucleo.download</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Nucleo</string>
    <key>DOWNLOAD_URL</key>
    <string>https://nucleoapp.com/download/mac/latest</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.8.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://nucleoapp.com/downloads</string>
        <key>re_pattern</key>
        <string>Download\s(\d\.\d\.\d)\sfor\sMac</string>
      </dict>
    </dict>
    <dict>
    	 <key>Processor</key>
    	 <string>URLDownloader</string>
    	 <key>Arguments</key>
    	 <dict>
        <key>url</key>
    		 <string>%DOWNLOAD_URL%</string>
    		 <key>filename</key>
    		 <string>%NAME%_%match%.zip</string>
    	 </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key>
        <string>%pathname%</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>purge_destination</key>
        <true/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/Nucleo.app</string>
        <key>requirement</key>
        <string>identifier "co.ambercreativelab.nucleo" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = KL2E79V8DF</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
