<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the .dmg file containing Gyazo and Gyazo GIF.</string>
  <key>Identifier</key>
  <string>com.github.dare-tech.gyazo.download</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Gyazo</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.8.0</string>
  <key>Process</key>
  <array>
    <dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string></string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%pathname%/Gyazo.app</string>
        <key>requirement</key>
        <string>anchor apple generic and identifier "com.gyazo.mac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9647Y3B7A4")</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
