<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the .dmg file containing Private Internet Access.</string>
  <key>Identifier</key>
  <string>com.github.dare-tech.privateinternetaccess.downlaod</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>PrivateInternetAccess</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.8.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://www.privateinternetaccess.com/pages/download</string>
        <key>re_pattern</key>
        <string>pia-macos-([\d\.]*-\d*)\.zip</string>
      </dict>
    </dict>
    <dict>
    	<key>Processor</key>
    	<string>URLDownloader</string>
    	<key>Arguments</key>
    	<dict>
        <key>url</key>
    		<string>https://installers.privateinternetaccess.com/download/pia-macos-%match%.zip</string>
        <key>filename</key>
        <string>%NAME%%match%.zip</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key>
        <string>%pathname%</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>purge_destination</key>
        <true/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/Private Internet Access Installer.app</string>
        <key>requirement</key>
        <string>identifier "com.privateinternetaccess.vpn" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5357M5NW9W"</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
