<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of SkyFonts and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.skyfonts.munki</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SkyFonts</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Applications</string>
			<key>developer</key>
			<string>Monotye Imaging Inc.</string>
			<key>description</key>
			<string>SkyFonts is the simplest way to try, install, and manage fonts.</string>
			<key>display_name</key>
			<string>SkyFonts</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

				/Applications/Utilities/Install\ SkyFonts.app/Contents/MacOS/Install\ SkyFonts


				exit 0</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
				<string>SkyFonts.app</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dare-tech.skyfonts.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>installs_item_paths</key>
					<string>/Applications/Utilities/Install SkyFonts.app</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
