<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
     <key>Identifier</key>
     <string>com.github.dare-tech.download.AffinityProducts</string>
     <key>Input</key>
     <dict>
        <key>NAME</key>
        <string>Affinity Designer 2</string>
        <key>PRODUCT</key>
        <string>designer2</string> <!-- photo, photo2, designer, designer2, publisher, publisher2 -->
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>SparkleUpdateInfoProvider</string>
        <key>Arguments</key>
        <dict>
          <key>appcast_url</key>
          <string>https://go.seriflabs.com/affinity-update-mac-retail-%PRODUCT%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%url%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%pathname%</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>purge_destination</key>
				  <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>input_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
          <key>requirement</key>
          <string>anchor apple generic and identifier "com.seriflabs.affinity%PRODUCT%" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6LVTQB9699")</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
