<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Capture One and imports it into Munki for use with perpetually-licensed Capture One.

Notes:

- Due to Phase One's decision to go with different versions for the software itself and marketing (e.g. Capture One version 13 is marketed as version 20), this recipe also has a MARKETING_VERSION variable to account for the discrepancy
- Major version upgrades of Capture One are generally paid upgrades, however Phase One's update URL doesn't stop at major version boundaries (e.g. the update URL for Capture One 7 offers a download of Capture One 9) and new major versions of Capture One are paid updates.  In an attempt to avoid accidentally downloading (and subsequently importing) Capture One updates that require a paid update, we restrict to an ACTUAL_VERSION and a corresponding MARKETING_VERSION.  When Phase One releases a new major version, this recipe will break until ACTUAL_VERSION and MARKETING_VERSION are updated (either via override or by updating this recipe)

This recipe is made for Capture One when licensed perpetually and has the following unique features/options when compared to the recipe for the subscription version of Capture One:

- Has a Munki "name" of "CaptureOneXX" ("name"-"marketing version") as opposed to the static name used in the subscription recipe
- STOP_ON_NO_NEW_DOWNLOAD Option: Skips import if no new file was retrieved in the "download" recipe (defaults to true).  Assuming a stable ETag, this allows the recipe to run (typically in an automated fashion) with force_munkiimport set to true but avoiding duplicate imports.  This allows this recipe for perpetually-licensed Capture One to run in tandem with the subscription-licensed Capture One recipe
- FORCE_MUNKIIMPORT Option: Controls whether force_munkiimport is enabled (defaults to true (the string value is set), switch to an empty set of string tags for false).  This allows the AutoPkg admin to control the force_munkiimport behavior in case it is required

Expected uses of this recipe:

- Capture One perpetual and Capture One subscription are in use: Recipe left in default state (STOP_ON_NO_NEW_DOWNLOAD is true, FORCE_MUNKIIMPORT is set)
- Only Capture One perpetual licensing is in use: STOP_ON_NO_NEW_DOWNLOAD is overridden to false, FORCE_MUNKIIMPORT is overridden to a null/empty string (although the behavior _should_ be acceptable even if these variables are not overridden)</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.munki.CaptureOne</string>
	<key>Input</key>
	<dict>
		<key>FORCE_MUNKIIMPORT</key>
		<string>totally</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/phaseone</string>
		<key>NAME</key>
		<string>CaptureOne</string>
		<key>STOP_ON_NO_NEW_DOWNLOAD</key>
		<true/>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-phaseone-%NAME%%MARKETING_VERSION%</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>The professional choice in imaging software.</string>
			<key>developer</key>
			<string>Phase One</string>
			<key>display_name</key>
			<string>Capture One %MARKETING_VERSION%</string>
			<key>name</key>
			<string>%NAME%%MARKETING_VERSION%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dare-tech.download.CaptureOne</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>download_changed == FALSE AND STOP_ON_NO_NEW_DOWNLOAD == TRUE</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>force_munkiimport</key>
				<string>%FORCE_MUNKIIMPORT%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>