<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Canva.</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.download.Canva</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Canva</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/14.0.1 Safari/605.1.15</string>
				</dict>
				<key>url</key>
				<string>https://www.canva.com/download/mac/universal/canva-desktop</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Canva.app</string>
				<key>requirement</key>
				<string>identifier "com.canva.CanvaDesktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5HD2ARTBFS"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Canva.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
