<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Overflow.</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.download.overflow</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Overflow</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://overflow.io/download/mac/</string>
        <key>re_pattern</key>
        <string>[a-z\d]{0,50}/Overflow-\d\.\d\.?[\d]?\.dmg</string>
      </dict>
			</dict>
			<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
    	 <dict>
        <key>url</key>
    		 <string>https://app-updates.overflow.io/packages/updates/osx_64/%match%</string>
    		 <key>filename</key>
    		 <string>%NAME%.dmg</string>
		</dict>
	</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
			<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Overflow.app</string>
				<key>requirement</key>
				<string>identifier "io.overflow.mac.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TK7YSGJFF"</string>
			</dict>
			</dict>
			</array>
</dict>
</plist>
