<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Use x64 for intel or arm64 for silicon</string>
	<key>Description</key>
	<string>Downloads the latest version of 4K YouTube to MP3</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.download.4kyoutubetomp3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>4K YouTube to MP3</string>
		<key>ARCH</key>
		<string>x64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
			<key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.3 Safari/605.1.15</string>
                </dict>
                <key>url</key>
                <string>https://www.4kdownload.com/downloads/34</string>
                <key>re_pattern</key>
                <string>https:\/\/dl\.4kdownload\.com\/app\/4kyoutubetomp3_\d+\.\d+\.\d+_%ARCH%\.dmg\?source=website</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/4K YouTube to MP3.app</string>
				<key>requirement</key>
				<string>identifier "com.openmedia.4kyoutubetomp3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GHQ37VJF83</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/4K YouTube to MP3.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
