<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Homebrew package version from GitHub and import into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dare-tech.munki.Homebrew</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Homebrew</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Homebrew</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Developer</string>
            <key>description</key>
            <string>The missing package manager for macOS.</string>
            <key>developer</key>
            <string>Mike McQuaid</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.3</string>
    <key>ParentRecipe</key>
    <string>com.github.dare-tech.download.Homebrew</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installcheck_script</key>
                    <string>#!/bin/zsh

          installed=1
          not_installed=0
          target_version="%version%"

          if [[ $(uname -m) == "x86_64" ]]; then
            brew="/usr/local/Homebrew/bin/brew"
          else
            brew="/opt/homebrew/bin/brew"
          fi

          if [[ ! -f "$brew" ]]; then
            exit "$not_installed"
          fi

          current_version=$($brew --version | /usr/bin/head -n 1 | /usr/bin/awk '{ print $2 }')

          if [[ "$current_version" != "$target_version" ]]; then
              exit "$not_installed"
          elif [[ "$current_version" == "$target_version" ]]; then
              exit "$installed"
          else
              exit "$not_installed"
          fi</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
