<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the .dmg file containing Sip.</string>
  <key>Identifier</key>
  <string>com.github.dare-tech.download.sip</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Sip</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.8.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://sipapp.io/updates/</string>
        <key>re_pattern</key>
        <string>updates/v2/sip-(\d\.\d\.?[\d]?)\.dmg</string>
      </dict>
    </dict>
    <dict>
    	 <key>Processor</key>
    	 <string>URLDownloader</string>
    	 <key>Arguments</key>
    	 <dict>
        <key>url</key>
    		 <string>https://sipapp.fra1.digitaloceanspaces.com/updates/v2/sip-%match%.dmg</string>
    		 <key>filename</key>
    		 <string>%NAME%.dmg</string>
    	 </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%pathname%/Sip.app</string>
        <key>requirement</key>
        <string>anchor apple generic and identifier "io.sipapp.Sip-paddle" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TQWQC67C6D)</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
