<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Set MUNKI_ARCHITECTURE to "arm64" for Apple Silicon or "x86_64" for Intel.</string>
    <key>Description</key>
    <string>Downloads the latest version of Lens Desktop for Kubernetes.</string>
    <key>Identifier</key>
    <string>com.github.dare-tech.munki.Lens</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_ARCHITECTURE</key>
        <string></string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Lens</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Lens Desktop is the only application you need to take control of your Kubernetes clusters.</string>
            <key>developer</key>
            <string>Mirantis, Inc.</string>
            <key>display_name</key>
            <string>Lens</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>supported_architectures</key>
            <array>
                <string>%MUNKI_ARCHITECTURE%</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dare-tech.download.Lens</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Lens.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
            <key>dmg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            <key>dmg_root</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
        </dict>
        <key>Processor</key>
        <string>DmgCreator</string>
    </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>