<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DBVisualizer.</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.download.dbvisualizer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DBVisualizer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://www.dbvis.com</string>
        <key>re_pattern</key>
        <string>dbvis-\d{1,2}\.\d{1,2}.\d{1,2}/media/dbvis_macos_\d{1,2}_\d{1,2}_\d{1,2}_jre.dmg</string>
      </dict>
			</dict>
			<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
    	 <dict>
        <key>url</key>
    		 <string>https://www.dbvis.com/product_download/%match%</string>
    		 <key>filename</key>
    		 <string>%NAME%.dmg</string>
		</dict>
	</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
			</array>
</dict>
</plist>
