<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Comment</key>
      <string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
      <key>Description</key>
      <string>Downloads the latest version of Grammarly Desktop and imports it into Munki.</string>
      <key>Identifier</key>
      <string>com.github.dare-tech.munki.GrammarlyDesktop</string>
      <key>Input</key>
      <dict>
         <key>APP_FILENAME</key>
         <string>Grammarly Installer</string>
         <key>MUNKI_REPO_SUBDIR</key>
         <string>apps/%NAME%</string>
         <key>NAME</key>
         <string>Grammarly Desktop</string>
         <key>pkginfo</key>
         <dict>
            <key>catalogs</key>
            <array>
               <string>testing</string>
            </array>
            <key>description</key>
            <string />
            <key>developer</key>
            <string>Grammarly, Inc</string>
            <key>display_name</key>
            <string>Grammarly Desktop</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
         </dict>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.dare-tech.download.GrammarlyDesktop</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>additional_pkginfo</key>
               <dict>
                  <key>installs</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>/Applications/Grammarly Desktop.app</string>
                        <key>type</key>
                        <string>application</string>
                        <key>CFBundleVersion</key>
                        <string>%version%</string>
                        <key>CFBundleIdentifier</key>
                        <string>com.grammarly.ProjectLlama</string>
                        <key>CFBundleShortVersionString</key>
                        <string>%version%</string>
                        <key>version_comparison_key</key>
                        <string>CFBundleVersion</string>
                        <key>CFBundleName</key>
                        <string>%NAME%</string>
                     </dict>
                  </array>
                  <key>version</key>
                  <string>%version%</string>
               </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%pathname%</string>
               <key>repo_subdirectory</key>
               <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
         </dict>
      </array>
   </dict>
</plist>
