<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of CatoClient and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.munki.CatoClient</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>CatoClient</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Updater.app</string>
				<string>CatoClient.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Cato Networks Ltd</string>
			<key>display_name</key>
			<string>CatoClient</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dare-tech.download.CatoClient</string>
	<key>Process</key>
	<array>
			<dict>
     <key>Arguments</key>
     <dict>
       <key>additional_pkginfo</key>
       <dict>
         <key>installs</key>
         <array>
           <dict>
             	<key>path</key>
		<string>/Applications/CatoClient.app</string>
		<key>type</key>
		<string>application</string>		
		<key>CFBundleVersion</key>
		<string>%version%</string>
		<key>CFBundleIdentifier</key>
		<string>com.catonetworks.mac.CatoClient</string>
		<key>CFBundleShortVersionString</key>
		<string>%version%</string>
		<key>version_comparison_key</key>
		<string>CFBundleShortVersionString</string>
		<key>CFBundleName</key>
	   	<string>%NAME%</string>
	</dict>
         </array>
	       <key>version</key>
		<string>%version%</string>
       </dict>
	     </dict>
     <key>Processor</key>
     <string>MunkiPkginfoMerger</string>
   </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/CatoClient.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
