<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MAMP.
  
  Architecture
  
  Intel = Intel-x86
  Silicon = M1-arm
  
  
  </string>
	<key>Identifier</key>
	<string>com.github.dare-tech.download.mamp</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://downloads.mamp.info/MAMP-PRO/releases</string>
		<key>NAME</key>
		<string>MAMP</string>
    <key>PLATFORM_ARCH</key>
		<string>Intel-x86</string>
		<key>SEARCH_URL</key>
		<string>https://www.mamp.info/en/downloads</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%SEARCH_URL%</string>
				<key>re_pattern</key>
				<string>href="(https:\/\/downloads.mamp.info\/MAMP-PRO\/macOS\/MAMP-PRO\/MAMP-MAMP-PRO-((?:(\d+)\.)?(?:(\d+)\.)?(\*|\d+))\-%PLATFORM_ARCH%.pkg)"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
				<key>filename</key>
				<string>MAMP.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: MAMP GmbH (5KCB5KHK77)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
