<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image and imports into Munki.
Some useful values for RELEASE are: 'latest', 'esr-latest', 'beta-latest'.
LOCALE controls the language localization to be downloaded.
Examples include 'en-US', 'de', 'sv-SE', and 'zh-TW'
See the following URLs for more info:
    http://ftp.mozilla.org/pub/firefox/releases/latest/README.txt
    http://ftp.mozilla.org/pub/firefox/releases/latest-esr/README.txt
    http://ftp.mozilla.org/pub/firefox/releases/latest-beta/README.txt</string>
    <key>Identifier</key>
    <string>com.github.dare-tech.munki.firefox-rc-en_US</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/firefox</string>
        <key>NAME</key>
        <string>Firefox</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Mozilla Firefox is a free and open source web browser.</string>
            <key>display_name</key>
            <string>Mozilla Firefox</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.firefox-rc-en_US</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installcheck_script</key>
                    <string>#!/bin/zsh

if [[ -e /Applications/Firefox.app/Contents/Resources/application.ini ]]; then
	echo "Found Firefox at path /Applications/Firefox.app"
	echo "Checking Firefox installed release..."
	IFS=$'\n\b'
	iniContents=($(cat /Applications/Firefox.app/Contents/Resources/application.ini))
	for line in ${iniContents[@]} ; do
		if [[ "$line" == "RemotingName=firefox-esr" ]]; then
			echo "Installed Firefox release is Firefox ESR"
        elif [[ "$line" == "RemotingName=firefox" ]]; then
			echo "Installed Firefox release is Firefox standard edition"
			target_version="%version%"
			installed_version=$(defaults read /Applications/Firefox.app/Contents/Info.plist CFBundleShortVersionString)
			echo "Latest Firefox Version: $target_version"
			echo "Installed Firefox Version: $installed_version"
			if [ ${installed_version:-0} \< $target_version ]; then
				echo "Update is required for Firefox"
				exit 0 
			else
				echo "Update is not required for Firefox"
				exit 1
			fi
		fi
	done
fi

exit 1</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
