<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>For ARCH - use dmg for intel or arm for silicon</string>
	<key>Description</key>
	<string>Downloads the latest version of Slimjet.</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.download.Slimjet</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>FlashPeak Slimjet</string>
		<key>NAME</key>
		<string>Slimjet</string>
		<key>ARCH</key>
		<string>dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://www.slimjet.com/download.php?version=mac&amp;type=%ARCH%&amp;beta=&amp;server=</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/FlashPeak Slimjet.app</string>
				<key>requirement</key>
				<string>identifier "com.flashpeak.Slimjet" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "698GVVZ48C"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/FlashPeak Slimjet.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
