<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the .zip file containing Tweeten.app.</string>
  <key>Identifier</key>
  <string>com.github.dare-tech.download.tweeten</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Tweeten</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.8.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://github.com/MehediH/Tweeten/releases</string>
        <key>re_pattern</key>
        <string>/releases/download/v(\d\.\d\.\d)/tweeten-darwin-x64.zip</string>
      </dict>
    </dict>
    <dict>
    	 <key>Processor</key>
    	 <string>URLDownloader</string>
    	 <key>Arguments</key>
    	 <dict>
        <key>url</key>
    		 <string>https://github.com/MehediH/Tweeten/%match%</string>
    		 <key>filename</key>
    		 <string>%NAME%.zip</string>
    	 </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key>
        <string>%pathname%</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>purge_destination</key>
        <true/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
        <key>requirement</key>
        <string>identifier "com.builtbymeh.tweeten" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = B5N4NT28HE</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
