<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of VirtualBox
  
  Acceptable values for PLATFORM_ARCH include:
	
	- 'OSX' : Downloads the Intel version of VirtualBox. (This is the default.)
	- 'macOSArm64' : Downloads the Apple Silicon version of VirtualBox.
  
  </string>
	<key>Identifier</key>
	<string>com.github.dare-tech.virtualbox.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VirtualBox</string>
    <key>PLATFORM_ARCH</key>
		<string>OSX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://download.virtualbox.org/virtualbox/[0-9\.]*/VirtualBox-[A-Z\0-9\.\_\.]*.%PLATFORM_ARCH%.dmg</string>
				<key>url</key>
				<string>https://www.virtualbox.org/wiki/Downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Oracle America, Inc. (VB5E2TV963)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/VirtualBox.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
