<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>VirtualBox is a general-purpose full virtualizer for x86 hardware, targeted at server, desktop and embedded use.</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.virtualbox.munki</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>VirtualBox</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>VirtualBox is a general-purpose full virtualizer for x86 hardware, targeted at server, desktop and embedded use.</string>
			<key>developer</key>
			<string>Oracle</string>
			<key>display_name</key>
			<string>VirtualBox</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.VirtualBox</string>
	<key>Process</key>
	<array>
	<dict>
     <key>Arguments</key>
     <dict>
       <key>additional_pkginfo</key>
       <dict>
         <key>installs</key>
         <array>
           <dict>
             	<key>path</key>
		<string>/Applications/VirtualBox.app</string>
		<key>type</key>
		<string>application</string>		
		<key>CFBundleVersion</key>
		<string>%version%</string>
		<key>CFBundleIdentifier</key>
		<string>org.virtualbox.app.VirtualBox</string>
		<key>CFBundleShortVersionString</key>
		<string>%version%</string>
		<key>version_comparison_key</key>
		<string>CFBundleShortVersionString</string>
		<key>CFBundleName</key>
	   	<string>%NAME%</string>
	</dict>
         </array>
	       <key>version</key>
		<string>%version%</string>
       </dict>
	     </dict>
     <key>Processor</key>
     <string>MunkiPkginfoMerger</string>
   </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/VirtualBox.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
