<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MySQL ODBC Connector</string>
	<key>Identifier</key>
	<string>com.github.dare-tech.download.mysqlconnector</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MySQL Connector</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://dev.mysql.com/downloads/connector/odbc/</string>
        <key>re_pattern</key>
        <string>(mysql-connector-odbc-\d{1,2}.\d{1,2}.?\d{1,2}-macos\d\d.\d\d-x86-64bit.dmg)</string>
      </dict>
			</dict>
			<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
    	 <dict>
        <key>url</key>
    		 <string>https://dev.mysql.com/get/Downloads/Connector-ODBC/8.0/%match%</string>
    		 <key>filename</key>
    		 <string>%NAME%.dmg</string>
		</dict>
	</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
			</array>
</dict>
</plist>
