<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of ZAP.</string>
  <key>Identifier</key>
  <string>com.github.dare-tech.zap.download</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>zap</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://www.zaproxy.org/download/</string>
        <key>re_pattern</key>
        <string>(\d\.\d\.?[\d]?).dmg</string>
        <key>result_output_var_name</key>
        <string>version</string>
      </dict>
    </dict>
    <dict>
    	 <key>Processor</key>
    	 <string>URLDownloader</string>
    	 <key>Arguments</key>
    	 <dict>
        <key>url</key>
    		 <string>https://github.com/zaproxy/zaproxy/releases/download/v%version%/ZAP_%version%.dmg</string>
    		 <key>filename</key>
    		 <string>%NAME%.dmg</string>
    	 </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
